STMicroelectronics/STM32CubeWBA/Projects/NUCLEO-WBA55CG/Applications/Thread/Thread_OTA_Client/STM32_WPAN/App/app_thread.c
/* USER CODE BEGIN Header */
/**
 ******************************************************************************
  * File Name          : app_thread.c
  * Description        : Thread Application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2023 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Includes ------------------------------------------------------------------*/
#include <assert.h>
#include <stdint.h>

#include "app_conf.h"
#include "app_common.h"
#include "app_entry.h"
#include "log_module.h"
#include "app_thread.h"
#include "dbg_trace.h"
#include "stm32_rtos.h"
#include "stm32_timer.h"
#if (CFG_LPM_LEVEL != 0)
#include "stm32_lpm.h"
#endif // CFG_LPM_LEVEL
#include "common_types.h"
#include "instance.h"
#include "radio.h"
#include "platform.h"
#include "ll_sys_startup.h"
#include "event_manager.h"
#include "platform_wba.h"
#include "link.h"
#include "cli.h"
#include "coap.h"
#include "tasklet.h"
#include "thread.h"
#if (OT_CLI_USE == 1)
#include "uart.h"
#endif
#include "joiner.h"
#include "alarm.h"
#include OPENTHREAD_CONFIG_FILE

/* Private includes -----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include "stm32wbaxx_nucleo.h"
#include "udp.h"
#include "app_bsp.h"
#include "logging_stm32wba.h"

void BootModeCheck(void);
/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */
/**
  * @brief  APP_THREAD Status structures definition
  */
typedef enum
{
  APP_THREAD_OK       = 0x00,
  APP_THREAD_ERROR    = 0x01,
} APP_THREAD_StatusTypeDef;

/* OTA Client information */
struct APP_THREAD_OtaClientInfo_t
{
  uint32_t              otaTagOffset; /* The OTA tag offset from the base address in flash (the address of the magic keyword is located here) */
  uint32_t              magicKeyword; /* The image magic keyword (terminating word) */
};

typedef struct
{
  uint32_t binarySize;
  uint32_t binaryCrcAddress;
  uint32_t baseAddress;
  uint32_t magicKeyword;
} APP_THREAD_OtaContext_t;

typedef void (*fct_t)(void);

/* USER CODE END PTD */

/* Private defines -----------------------------------------------------------*/
#define C_PANID                 0xBA98U
#define C_CHANNEL_NB            16U
#define C_CCA_THRESHOLD         (-70)

/* USER CODE BEGIN PD */
#define LED_TOGGLE_TIMING_MS     1000u

/* Define the start address where the application shall be located */
#define CFG_APP_START_SECTOR_INDEX          (0x40u)

/* Define list of reboot reason */
#define FUOTA_MAGIC_KEYWORD_M33_APP         0xBF806133u       /* Keyword found at the end of Zigbee Ota file for M33 Application Processor binary */

#define HW_FLASH_WIDTH                      (16u)   // Write Length in Bytes (128 bits = 4 words)

#define C_RESSOURCE_FUOTA_PROVISIONING     "FUOTA_PROVISIONING"
#define C_RESSOURCE_FUOTA_PARAMETERS       "FUOTA_PARAMETERS"
#define C_RESSOURCE_FUOTA_SEND             "FUOTA_SEND"

#define FUOTA_NUMBER_WORDS_64BITS           50
#define FUOTA_PAYLOAD_SIZE                  FUOTA_NUMBER_WORDS_64BITS * 8

#define RAM_FIRMWARE_BUFFER_SIZE            1024u

#define FUOTA_APP_FW_BINARY_ADDRESS         (FLASH_BASE + ( CFG_APP_START_SECTOR_INDEX * FLASH_PAGE_SIZE))     /* Address for Application Processor FW Update */
#define FUOTA_APP_FW_BINARY_MAX_SIZE        (FLASH_BASE + FLASH_SIZE - FUOTA_APP_FW_BINARY_ADDRESS)     /* Size of the available flash space for OTA Image */

#define FUOTA_M33_APP_OTA_TAG_OFFSET        0x160u            /* Offset of the OTA tag from the base address in flash for M33 Applciation Processor binary */
#define FUOTA_M33_APP_OTA_TAG_ADDRESS       (FUOTA_APP_FW_BINARY_ADDRESS + FUOTA_M33_APP_OTA_TAG_OFFSET)       /* Address of the OTA tag in flash for M33 Application Processor binary */

/**
 * Define list of reboot reason
 */
#define CFG_REBOOT_ON_DOWNLOADED_FW         0x0         /* Reboot on the downloaded Firmware */
#define CFG_REBOOT_ON_OTA_CLIENT_FW         0xaau       /* Reboot on Thread_OTA_Client FW */

#define OTA_RESET_WAIT_TIME                 100

/* USER CODE END PD */

/* Private macros ------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private function prototypes -----------------------------------------------*/
static void APP_THREAD_DeviceConfig(void);
static void APP_THREAD_StateNotif(uint32_t NotifFlags, void *pContext);
static void APP_THREAD_TraceError(const char * pMess, uint32_t ErrCode);

#if (OT_CLI_USE == 1)
static void APP_THREAD_CliInit(otInstance *aInstance);
static void APP_THREAD_ProcessUart(void);
#endif // OT_CLI_USE

static void APP_THREAD_PersistenceStartup(void);

/* USER CODE BEGIN PFP */
static void APP_THREAD_AppInit(void);
static inline void APP_THREAD_DeleteSectors( uint32_t lBaseAddress, uint32_t lBinarySize );
static bool APP_THREAD_OTA_HardwareCalculateCrc( CRC_HandleTypeDef * pstCrcHandle, uint32_t* plBuffer, uint32_t lBufferSize, uint32_t* plCrc );

static void APP_THREAD_CoapReqHandlerFuotaProvisioning(
    void                * pContext,
    otMessage           * pMessage,
    const otMessageInfo * pMessageInfo);
static otError APP_THREAD_ProvisioningRespSend(otMessage    * pMessage,
    const otMessageInfo * pMessageInfo);

static void APP_THREAD_CoapReqHandlerFuota(
    void                * pContext,
    otMessage           * pMessage,
    const otMessageInfo * pMessageInfo);
static void APP_THREAD_CoapSendDataResponseFuota(otMessage    * pMessage,
    const otMessageInfo * pMessageInfo);

static void APP_THREAD_CoapReqHandlerFuotaParameters(
    void                 * pContext,
    otMessage            * pMessage,
    const otMessageInfo  * pMessageInfo);
static void APP_THREAD_CoapSendRespFuotaParameters(otMessage    * pMessage,
    const otMessageInfo * pMessageInfo,
    uint8_t * pData);

static void APP_THREAD_PerformReset( void * arg );
static void APP_THREAD_TimingElapsed(void * args);
static APP_THREAD_StatusTypeDef APP_THREAD_CheckDeviceCapabilities(void);
static bool APP_THREAD_ValidateOta(void);
static void APP_THREAD_FuotaInit(void);

static void JumpFwApp( void );
static bool CheckFwAppValidity( void );
static void JumpSelectionOnPowerUp( void );

/* USER CODE END PFP */

