STMicroelectronics/STM32CubeWBA/Projects/NUCLEO-WBA55CG/Applications/Thread/Thread_OTA_Client/STM32_WPAN/App/app_thread.c
    /* Check if the magic keyword address is inside the flash region */
  if ( lMagicKeywordAddress < OtaContext.baseAddress || lMagicKeywordAddress > lFlashEndAddress - sizeof( lBinaryMagicKeyword ) )
  {
    LOG_ERROR_APP( "[OTA] Error, magic keyword address is outside the flash region (0x%08X).", lMagicKeywordAddress );
    return false;
  }

  /* Check if the CRC is inside the flash region */
  if ( lCrcAddress < OtaContext.baseAddress  || lCrcAddress > lFlashEndAddress - sizeof( lBinaryCrc ) )
  {
    LOG_ERROR_APP( "[OTA] Error, CRC address is outside the flash region (0x%08X ).", lCrcAddress );
    return false;
  }

  /* Check if the magic keyword is correct */
  lBinaryMagicKeyword = * ( uint32_t * )( lMagicKeywordAddress );
  if ( lBinaryMagicKeyword != stOtaClientInfo.magicKeyword )
  {
    LOG_ERROR_APP( "[OTA] Error, magic keyword is incorrect (0x%08X != 0x%08X ).", lBinaryMagicKeyword, OtaContext.magicKeyword );
    return false;
  }
 
  
  /* Check if the CRC is correct */
  if ( APP_THREAD_OTA_HardwareCalculateCrc( &stOtaCrcHandle, (uint32_t *)OtaContext.baseAddress, lCrcAddress - OtaContext.baseAddress, &lCrc ) == false )
  {
    LOG_ERROR_APP( "[OTA] Error, CRC calculation failed." );
    return false;
  }
  lBinaryCrc = * ( uint32_t * )( lCrcAddress );
  if ( lBinaryCrc != lCrc )
  {
    LOG_ERROR_APP( "[OTA] Error, CRC is incorrect (0x%08X  != 0x%08X ).", lBinaryCrc, lCrc );
    return false;
  }
  
  lBinaryEndAddress = (uint32_t *)((uint32_t)lCrcAddress + sizeof( lBinaryCrc ));
  /* check binary size and CRC */
  if (OtaContext.binarySize != ((uint32_t)lBinaryEndAddress - OtaContext.baseAddress) )
  {
    LOG_ERROR_APP( "[OTA] Error, Binary size is not correct (0x%08X  != 0x%08X ).", OtaContext.binarySize, ((uint32_t)lBinaryEndAddress - OtaContext.baseAddress) );
    return false;
  }

  return true;
}

static void APP_THREAD_FuotaInit(void)
{
  /* Erase the sectors used to download the image */
  LOG_INFO_APP( "[OTA] Deleting flash sectors from 0x%08X with size 0x%08X", FUOTA_APP_FW_BINARY_ADDRESS, FUOTA_APP_FW_BINARY_MAX_SIZE);

  /* Delete all the sector needed for the image */
  APP_THREAD_DeleteSectors(FUOTA_APP_FW_BINARY_ADDRESS, FUOTA_APP_FW_BINARY_MAX_SIZE);

  UTIL_TIMER_Create( &TimerID, 0, UTIL_TIMER_PERIODIC, APP_THREAD_TimingElapsed, NULL ); 
  
}

/**
 * @brief  OTA compute CRC in hardware
 * @param  pstCrcHandle: CRC handle
 * @param  plBuffer: Buffer to compute CRC over
 * @param  lBufferSize: Buffer size in bytes
 * @param  plCrc: Computed CRC
 * @retval False if HAL_CRC_Init failed
 */
static bool APP_THREAD_OTA_HardwareCalculateCrc( CRC_HandleTypeDef * pstCrcHandle, uint32_t* plBuffer, uint32_t lBufferSize, uint32_t* plCrc )
{
  HAL_StatusTypeDef     eHalStatus;

  if ( HAL_CRC_GetState( pstCrcHandle ) == HAL_CRC_STATE_RESET )
  {
    /* Initialize the CRC */
    LOG_INFO_APP( "[OTA] Initializing the CRC module" );
    pstCrcHandle->Instance = CRC;
    pstCrcHandle->Init.DefaultPolynomialUse = DEFAULT_POLYNOMIAL_ENABLE;
    pstCrcHandle->Init.DefaultInitValueUse = DEFAULT_INIT_VALUE_ENABLE;
    pstCrcHandle->Init.CRCLength = CRC_POLYLENGTH_32B;
    pstCrcHandle->Init.InitValue = 0xFFFFFFFF;
    pstCrcHandle->Init.InputDataInversionMode = CRC_INPUTDATA_INVERSION_BYTE;
    pstCrcHandle->Init.OutputDataInversionMode = CRC_OUTPUTDATA_INVERSION_ENABLE;
    pstCrcHandle->InputDataFormat = CRC_INPUTDATA_FORMAT_BYTES;
    eHalStatus = HAL_CRC_Init( pstCrcHandle );
    if ( eHalStatus != HAL_OK )
    {
      LOG_ERROR_APP( "[OTA] Error, HAL_CRC_Init failed (0x%08X)", eHalStatus );
      return false;
    }
  }

  /* Compute the CRC */
  *plCrc = ~HAL_CRC_Calculate( pstCrcHandle, plBuffer, lBufferSize );
  
  if (HAL_CRC_DeInit(pstCrcHandle) != HAL_OK )
  {
    LOG_ERROR_APP( "[OTA] Error, CRC can not be de-initialized.");
    return false;
  }
  
  return true;
}

/**
 * @brief  Deleting sectors helper
 * @param  None
 * @retval None
 */
static inline void APP_THREAD_DeleteSectors( uint32_t lBaseAddress, uint32_t lBinarySize )
{
  FLASH_EraseInitTypeDef        stEraseInit;
  uint32_t                      lPageError;

  /* Determine the page, the number of pages to delete, etc. */
  stEraseInit.TypeErase = FLASH_TYPEERASE_PAGES;
  stEraseInit.Page = ( lBaseAddress - FLASH_BASE ) / FLASH_PAGE_SIZE;
  stEraseInit.NbPages = lBinarySize / FLASH_PAGE_SIZE;
  if ( lBinarySize % FLASH_PAGE_SIZE != 0 )
  {
    stEraseInit.NbPages++;
  }

  LOG_DEBUG_APP( "stEraseInit" );
  LOG_DEBUG_APP( ".TypeErase     = 0x%08X", stEraseInit.TypeErase );
  LOG_DEBUG_APP( ".Page          = 0x%08X", stEraseInit.Page );
  LOG_DEBUG_APP( ".NbPages       = %u", stEraseInit.NbPages );

  /* Delete the flash sectors */
  HAL_FLASH_Unlock();
  HAL_FLASHEx_Erase(&stEraseInit, &lPageError);
  HAL_FLASH_Lock();
}

/**
 * @brief Handler called when the server receives a COAP request.
 *
 * @param pContext : Context
 * @param pMessage : Message
 * @param pMessageInfo : Message information
 * @retval None
 */
static void APP_THREAD_CoapReqHandlerFuotaProvisioning(
    void                 * pContext,
    otMessage            * pMessage,
    const otMessageInfo  * pMessageInfo)
{
  LOG_INFO_APP(" Received CoAP request on FUOTA_PROVISIONING resource");

  if (otCoapMessageGetType(pMessage) == OT_COAP_TYPE_CONFIRMABLE)
  {
    if (APP_THREAD_ProvisioningRespSend(pMessage, pMessageInfo) != OT_ERROR_NONE)
    {
      APP_THREAD_Error(ERR_THREAD_PROVISIONING_RESP, 0);
    }
  }
}

/**
 * @brief This function acknowledges the data reception by sending an ACK
 *    back to the sender.
 * @param  pRequestHeader coap header
 * @param  pMessageInfo message info pointer
 * @retval None
 */
static otError APP_THREAD_ProvisioningRespSend(otMessage * pMessage,
    const otMessageInfo * pMessageInfo)
{
  otError  error = OT_ERROR_NONE;

  do{
    LOG_INFO_APP("Provisioning: Send CoAP response");

    pOT_MessageResponse = otCoapNewMessage(NULL, NULL);
    if (pOT_MessageResponse == NULL)
    {
      LOG_WARNING_APP("WARNING : pOT_MessageResponse = NULL ! -> exit now");
      break;
    }

    (void)otCoapMessageInitResponse(pOT_MessageResponse,
        pMessage,
        OT_COAP_TYPE_ACKNOWLEDGMENT,
        OT_COAP_CODE_CHANGED);

    (void)otCoapMessageSetPayloadMarker(pOT_MessageResponse);

    error = otMessageAppend(pOT_MessageResponse, &OT_Command, sizeof(OT_Command));
    if (error != OT_ERROR_NONE)
    {
      APP_THREAD_Error(ERR_THREAD_COAP_APPEND_MSG, error);
    }

    error = otMessageAppend(pOT_MessageResponse, otThreadGetMeshLocalEid(PtOpenThreadInstance), sizeof(otIp6Address));
    if (error != OT_ERROR_NONE)
    {
      APP_THREAD_Error(ERR_THREAD_COAP_ALLOC_MSG, error);
      break;
    }

    error = otCoapSendResponse(PtOpenThreadInstance, pOT_MessageResponse, pMessageInfo);
    if (error != OT_ERROR_NONE && pOT_MessageResponse != NULL)
    {
      otMessageFree(pOT_MessageResponse);
      APP_THREAD_Error(ERR_THREAD_COAP_DATA_RESPONSE,error);
    }
  }while(false);

  return error;
}

/**
 * @brief Handler called when the server receives a COAP request.
 *
 * @param pContext : Context
 * @param pHeader : Header
 * @param pMessage : Message
 * @param pMessageInfo : Message information
 * @retval None
 */
static void APP_THREAD_CoapReqHandlerFuotaParameters(
    void                 * pContext,
    otMessage            * pMessage,
    const otMessageInfo  * pMessageInfo)
{
  if (otMessageRead(pMessage, otMessageGetOffset(pMessage), &OtaContext, sizeof(OtaContext)) != sizeof(OtaContext))
  {
    APP_THREAD_Error(ERR_THREAD_MESSAGE_READ, 0);
  }

  /* Display Ota_Context values */
  LOG_INFO_APP("FUOTA_PARAMETERS: Binary Size = 0x%x", OtaContext.binarySize);
  LOG_INFO_APP("FUOTA_PARAMETERS: Address = 0x%x", OtaContext.baseAddress);
  LOG_INFO_APP("FUOTA_PARAMETERS: Magic Keyword = 0x%x", OtaContext.magicKeyword);

  /* Check if Device can be updated with Fuota Server request */
  if (APP_THREAD_CheckDeviceCapabilities() == APP_THREAD_OK)
  {
    OT_Command = APP_THREAD_OK;
    UTIL_TIMER_StartWithPeriod(&TimerID, LED_TOGGLE_TIMING_MS);
  }
  else
  {
    OT_Command = APP_THREAD_ERROR;
    LOG_WARNING_APP("WARNING: Current Device capabilities cannot handle FUOTA. Check memory size available!");
  }
  /* If Message is Confirmable, send response */
  if (otCoapMessageGetType(pMessage) == OT_COAP_TYPE_CONFIRMABLE)
  {
    APP_THREAD_CoapSendRespFuotaParameters(pMessage, pMessageInfo, &OT_Command);
  }
}

static APP_THREAD_StatusTypeDef APP_THREAD_CheckDeviceCapabilities(void)
{
  APP_THREAD_StatusTypeDef status = APP_THREAD_OK;
  
  /* Check that the OTA image can fit in the available Flash space */
  if (OtaContext.baseAddress == FUOTA_APP_FW_BINARY_ADDRESS)
  {
    if (OtaContext.binarySize > FUOTA_APP_FW_BINARY_MAX_SIZE)
    {
      status = APP_THREAD_ERROR;
      LOG_ERROR_APP("WARNING: Not enough Free Flash Memory available to download binary from Server!");
    }
    else
    {
      LOG_DEBUG_APP("Device contains enough Flash Memory to download binary");
    }
  }
  else
  {
    status = APP_THREAD_ERROR;
    LOG_ERROR_APP("WARNING: Invalid OTA Image Base address");
  }

