STMicroelectronics/STM32CubeWBA/Projects/NUCLEO-WBA55CG/Applications/Thread/Thread_OTA_Client/STM32_WPAN/App/app_thread.c
  return status;
}

/**
 * @brief  OTA client writing firmware data from internal RAM cache to flash
 * @param  lFlashAddress: Address in flash
 * @param  pcFirmwareBuffer: RAM buffer to write to flash
 * @param  lFirmwareBufferSize: RAM buffer size
 * @retval Application status code
 */
static inline APP_THREAD_StatusTypeDef APP_THREAD_OTA_ClientWriteFirmwareData( uint32_t lFlashAddress, uint8_t * pcFirmwareBuffer, uint32_t lFirmwareBufferSize )
{
  uint32_t                      lIndex;
  HAL_StatusTypeDef             eHalStatus;
  APP_THREAD_StatusTypeDef      eStatus = APP_THREAD_OK;

  for( lIndex = 0; lIndex < lFirmwareBufferSize; lIndex += HW_FLASH_WIDTH )
  {
    /* Write to Flash Memory */
    uint32_t    lWord1 = * ( ( uint32_t *)( &pcFirmwareBuffer[lIndex + 0 * sizeof( uint32_t )] ) );
    uint32_t    lWord2 = * ( ( uint32_t *)( &pcFirmwareBuffer[lIndex + 1 * sizeof( uint32_t )] ) );
    uint32_t    lWord3 = * ( ( uint32_t *)( &pcFirmwareBuffer[lIndex + 2 * sizeof( uint32_t )] ) );
    uint32_t    lWord4 = * ( ( uint32_t *)( &pcFirmwareBuffer[lIndex + 3 * sizeof( uint32_t )] ) );
    LOG_DEBUG_APP( "0x%08X | 0x%08X | 0x%08X | 0x%08", lWord1, lWord2, lWord3, lWord4 );

    HAL_FLASH_Unlock();

    eHalStatus = HAL_FLASH_Program( FLASH_TYPEPROGRAM_QUADWORD, lFlashAddress + lIndex, ( uint32_t )&pcFirmwareBuffer[lIndex] );
    if ( eHalStatus != HAL_OK )
    {
      LOG_ERROR_APP( "[OTA] Error, HAL_FLASH_Program failed (0x%02X).", eHalStatus );
      eStatus = APP_THREAD_ERROR;
    }
    
    HAL_FLASH_Lock();

    /* Read back the value for verification */
    if ( memcmp( ( void * )( lFlashAddress + lIndex ), &pcFirmwareBuffer[lIndex], HW_FLASH_WIDTH ) != 0x00u )
    {
      LOG_ERROR_APP( "[OTA] Error, flash verifaction failed." );
      eStatus = APP_THREAD_ERROR;
    }

    if (eStatus != APP_THREAD_OK)
    {
      return eStatus;
    }
  }

  return eStatus;
}

static void APP_THREAD_ResetFuotaProcess(void)
{
   gFlashCurrentOffset = 0;
   UTIL_TIMER_Stop(&TimerID);
   BSP_LED_Off(LED_BLUE);
   
   LOG_INFO_APP( "[OTA] Deleting flash sectors from 0x%08X to 0x%08X", FUOTA_APP_FW_BINARY_ADDRESS, FUOTA_APP_FW_BINARY_ADDRESS + FUOTA_APP_FW_BINARY_MAX_SIZE);

   APP_THREAD_DeleteSectors(FUOTA_APP_FW_BINARY_ADDRESS, FUOTA_APP_FW_BINARY_MAX_SIZE);
}

/**
 * @brief Handler called when the server receives a COAP request.
 *
 * @param pContext : Context
 * @param pHeader : Header
 * @param pMessage : Message
 * @param pMessageInfo : Message information
 * @retval None
 */
static void APP_THREAD_CoapReqHandlerFuota(
    void                 *pContext,
    otMessage            * pMessage,
    const otMessageInfo  * pMessageInfo)
{
  bool     lEndFullBinTransfer = FALSE;
  
  if (OtaContext.baseAddress == 0)
  {
    return;
  }
  
  if (otMessageRead(pMessage, otMessageGetOffset(pMessage), &FuotaTransferArray, FUOTA_PAYLOAD_SIZE) != FUOTA_PAYLOAD_SIZE)
  {
    APP_THREAD_Error(ERR_THREAD_MESSAGE_READ, 0);
  }
  
  if(OtaContext.baseAddress + gFlashCurrentOffset > (FLASH_BASE + FLASH_SIZE)) 
  {
    /**
     * The address is not valid
     */
    /* Invalid FUOTA */
    LOG_ERROR_APP("ERROR : Invalid keyword ");
    APP_THREAD_ResetFuotaProcess();

    return ;
  }
  else
  { 
    APP_THREAD_OTA_ClientWriteFirmwareData(OtaContext.baseAddress + gFlashCurrentOffset, (uint8_t*)FuotaTransferArray, FUOTA_PAYLOAD_SIZE);
    gFlashCurrentOffset += FUOTA_PAYLOAD_SIZE;
    
    if (gFlashCurrentOffset >= OtaContext.binarySize)
    {
      lEndFullBinTransfer = TRUE;
    }
  }

  /* If Message is Confirmable, send response */
  if (otCoapMessageGetType(pMessage) == OT_COAP_TYPE_CONFIRMABLE)
  {
    APP_THREAD_CoapSendDataResponseFuota(pMessage, pMessageInfo);
  }

  if(lEndFullBinTransfer == TRUE)
  {
    if (APP_THREAD_ValidateOta() == TRUE)
    {
      /* Wait until the Coap Response is sent to the OTA server */
      UTIL_TIMER_StartWithPeriod( &resetTimerId, OTA_RESET_WAIT_TIME );
    }
    else
    {
      LOG_ERROR_APP("ERROR : OTA Image is not Valid ");
      APP_THREAD_ResetFuotaProcess();
    }
    
  }
}

/**
 * @brief This function acknowledges the data reception by sending an ACK
 *    back to the sender.
 * @param  pRequestHeader coap header
 * @param  pMessageInfo message info pointer
 * @retval None
 */
static void APP_THREAD_CoapSendDataResponseFuota(otMessage    * pMessage,
    const otMessageInfo * pMessageInfo)
{
  otError  error = OT_ERROR_NONE;
  do{
    pOT_MessageResponse = otCoapNewMessage(NULL, NULL);
    if (pOT_MessageResponse == NULL)
    {
      LOG_WARNING_APP("WARNING : pOT_MessageResponse = NULL ! -> exit now");
      break;
    }

    (void)otCoapMessageInitResponse(pOT_MessageResponse,
        pMessage,
        OT_COAP_TYPE_ACKNOWLEDGMENT,
        OT_COAP_CODE_CHANGED);

    error = otCoapSendResponse(PtOpenThreadInstance, pOT_MessageResponse, pMessageInfo);
    if (error != OT_ERROR_NONE && pOT_MessageResponse != NULL)
    {
      otMessageFree(pOT_MessageResponse);
      APP_THREAD_Error(ERR_THREAD_COAP_DATA_RESPONSE,error);
    }
  }while(false);
}

/**
 * @brief This function acknowledges the data reception by sending an ACK
 *    back to the sender.
 * @param  pMessage     message pointer
 * @param  pMessageInfo message info pointer
 * @param  pData        Data pointer
 * @retval None
 */
static void APP_THREAD_CoapSendRespFuotaParameters(otMessage    * pMessage,
    const otMessageInfo * pMessageInfo,
    uint8_t * pData)
{
  otError  error = OT_ERROR_NONE;
  uint8_t data = *pData;
  LOG_DEBUG_APP("APP_THREAD_CoapSendRespFuotaParameters data = %d", data);

  do{
    LOG_DEBUG_APP("FUOTA: Send CoAP response for Fuota Parameters");

    pOT_MessageResponse = otCoapNewMessage(NULL, NULL);
    if (pOT_MessageResponse == NULL)
    {
      LOG_DEBUG_APP("WARNING : pOT_MessageResponse = NULL ! -> exit now");
      break;
    }

    (void)otCoapMessageInitResponse(pOT_MessageResponse,
        pMessage,
        OT_COAP_TYPE_ACKNOWLEDGMENT,
        OT_COAP_CODE_CHANGED);

    (void)otCoapMessageSetPayloadMarker(pOT_MessageResponse);

    error = otMessageAppend(pOT_MessageResponse, &data, sizeof(data));
    if (error != OT_ERROR_NONE)
    {
      APP_THREAD_Error(ERR_THREAD_COAP_APPEND_MSG, error);
    }

    error = otCoapSendResponse(PtOpenThreadInstance, pOT_MessageResponse, pMessageInfo);
    if (error != OT_ERROR_NONE && pOT_MessageResponse != NULL)
    {
      otMessageFree(pOT_MessageResponse);
      APP_THREAD_Error(ERR_THREAD_COAP_DATA_RESPONSE,error);
    }
  }while(false);
}

/**
 * @brief Task responsible for the reset at the end of OTA transfer.
 * @param  None
 * @retval None
 */
static void APP_THREAD_PerformReset( void * arg )
{
  LOG_INFO_APP("*******************************************************");
  LOG_INFO_APP(" FUOTA_CLIENT : END OF TRANSFER COMPLETED");
  /* Stop Toggling of the LED */
  UTIL_TIMER_Stop(&TimerID);
  BSP_LED_On(LED_BLUE);
  
  LOG_INFO_APP("  --> Request to reboot on FW Application");
  LOG_INFO_APP("*******************************************************");
  /**
   * Reboot on FW Application
   */
  *(uint8_t*)SRAM1_BASE = CFG_REBOOT_ON_DOWNLOADED_FW;
  
  NVIC_SystemReset();
}

static void APP_THREAD_AppInit(void)
{
  UTIL_TIMER_Create( &resetTimerId, 0, UTIL_TIMER_ONESHOT, &APP_THREAD_PerformReset, NULL ); 
  
  LOG_INFO_APP("Thread_Ota_Client Application");
  
  /* disable OpenThread Logs */
  setDebugLevel(0);
}

