STMicroelectronics/STM32CubeWBA/Projects/NUCLEO-WBA55CG/Applications/Thread/Thread_OTA_Client/STM32_WPAN/App/app_thread.c
static void APP_THREAD_TimingElapsed(void * args)
{
  UNUSED(args);
  
  BSP_LED_Toggle(LED_BLUE);
}

/**
 * @brief Task associated to the push button 1.
 * @param  None
 * @retval None
 */
void APP_BSP_Button1Action(void)
{
  LOG_INFO_APP("Button 1 pressed");
}

/**
 * @brief Task associated to the push button 2.
 * @param  None
 * @retval None
 */
void APP_BSP_Button3Action(void)
{
  LOG_INFO_APP("Button3 pressed");
  APP_THREAD_ResetFuotaProcess();
}

/**
 * Check the Boot mode request
 * Depending on the result, the CPU may either jump to an existing application in the user flash
 * or keep on running the code to start the OTA loader
 */
void BootModeCheck( void )
{
  if(LL_RCC_IsActiveFlag_SFTRST( ) || LL_RCC_IsActiveFlag_OBLRST( ))
  {
    /**
     * Check Boot Mode from Image Marker
     */
    if((*(uint8_t*)SRAM1_BASE == CFG_REBOOT_ON_DOWNLOADED_FW))
    {
      if (CheckFwAppValidity() == true)
      {
        /**
         * The user has requested to start on the firmware application and it has been checked
         * a valid application is ready
         * Jump now on the application
         */
        JumpFwApp();
      }
    }
    else if(*(uint8_t*)SRAM1_BASE == CFG_REBOOT_ON_OTA_CLIENT_FW)
    {
      /**
       * It has been requested to reboot on Thread_OTA_Client application to download data
       */
    }
    else
    {
      /**
       * There should be no use case to be there because the device already starts from power up
       * and the SRAM1 is then filled with the value define by the user
       * However, it could be that a reset occurs just after a power up and in that case, the Thread_Ota
       * will be running but the sectors to download a new App may not be erased
       */
      JumpSelectionOnPowerUp( );
    }
  }
  else
  {
    /**
     * On Power up, the content of SRAM1 is random
     * The only thing that could be done is to jump on either the firmware application
     * or the Thread_OTA_Client application
     */
    JumpSelectionOnPowerUp( );
  }

  /**
   * Return to the startup file and run the Thread_Ota application
   */
  return;
}

static void JumpSelectionOnPowerUp( void )
{
    /**
     * The SRAM1 is random
     * Initialize SRAM1 to indicate we requested to reboot of Thread_OTA_Client application
     */
    *(uint8_t*)SRAM1_BASE = CFG_REBOOT_ON_OTA_CLIENT_FW;

    /**
     * There is no valid application available
     * Erase all sectors specified by byte1 and byte1 in SRAM1 to download a new App.
     */
    *((uint8_t*)SRAM1_BASE+1) = CFG_APP_START_SECTOR_INDEX;
    *((uint8_t*)SRAM1_BASE+2) = 0xFF;
}

/**
 * Jump to existing FW App in flash
 * It never returns
 */
static void JumpFwApp( void )
{
  fct_t appResetHandler;

  SCB->VTOR = FUOTA_APP_FW_BINARY_ADDRESS;
  __set_MSP( * ( uint32_t * )FUOTA_APP_FW_BINARY_ADDRESS );
  appResetHandler = (fct_t)(*(uint32_t*)(FUOTA_APP_FW_BINARY_ADDRESS + 4u ));
  appResetHandler();

  /**
   * appResetHandler() never returns.
   * However, if for any reason a PUSH instruction is added at the entry of  JumpFwApp(),
   * we need to make sure the POP instruction is not there before appResetHandler() is called
   * The way to ensure this is to add a dummy code after appResetHandler() is called
   * This prevents appResetHandler() to be the last code in the function.
   */
  __WFI();


  return;
}


static bool CheckFwAppValidity( void )
{
  bool status = true;
  uint32_t lMagicKeywordAddress = *(uint32_t*)FUOTA_M33_APP_OTA_TAG_ADDRESS;
  uint32_t lMagicKeywordValue = 0;

  if (lMagicKeywordAddress == 0xFFFFFFFF)
  {
    return false;
  }

  lMagicKeywordValue = *(uint32_t*)lMagicKeywordAddress;

  if( (lMagicKeywordAddress < FLASH_BASE) || (lMagicKeywordAddress > (FLASH_BASE + FLASH_SIZE) ) )
  {
    /**
     * The address is not valid
     */
    status = false;
  }
  else
  {
    if( lMagicKeywordValue != FUOTA_MAGIC_KEYWORD_M33_APP  )
    {
      /**
       * A firmware update procedure did not complete
       */
      status = false;
    }
    else
    {
      /**
       * The firmware application is available
       */
      status = true;

    }
  }
  return status;
}

/* USER CODE END FD_LOCAL_FUNCTIONS */

